package nw_simulator;

import java.util.HashMap;

public class Hub extends Node {

	/**********************************************
	 * メンバ変数
	 **********************************************/
	// 特になし
	
	
	
	/**********************************************
	 * コンストラクタ
	 **********************************************/
	Hub() {
		super();
	}
	
	Hub(int no) {
		super(no);
	}
	
	Hub(int no, int portNum) {
		super(no, portNum);
	}
	
	Hub(Hub hub) {
		super(hub);
	}
	

	
	/**********************************************
	 * Protectedメソッド
	 **********************************************/
	
}
