package nw_simulator;



/**********************************************
 * いわゆるケーブルを定義したもの
 **********************************************/
public class Link {
	
	/**********************************************
	 * メンバ変数
	 **********************************************/
	private int bandwidth;		// 帯域幅 (Mbps単位)
	
	
	
	/**********************************************
	 * コンストラクタ
	 **********************************************/
	// 楽したいとき用のやつ
	Link() {
		this.bandwidth = 100;
	}
	
	// 細かく定義できるやつ
	Link(int bandwidth) {
		this.bandwidth = bandwidth;
	}
	

	
	/**********************************************
	 * Protectedメソッド
	 **********************************************/
	// 帯域幅を返す
	protected int getBandwidth() {
		return this.bandwidth;
	}
}
